In [8]:
a = 100

In [9]:
a

100

In [3]:
c= {}

In [4]:
c

{}

In [6]:
c["test"]="abc"

In [10]:
c

{'test': 'abc'}

In [11]:
from pandas import Series, DataFrame

In [13]:
a = Series(["A", "B", "C", "D", "E"])

In [14]:
a

0    A
1    B
2    C
3    D
4    E
dtype: object

In [15]:
b = Series({"andrew":30, "sera":50, "thomas":20})

In [16]:
b

andrew    30
sera      50
thomas    20
dtype: int64

In [17]:
c=b.add(10)

In [18]:
c

andrew    40
sera      60
thomas    30
dtype: int64

In [19]:
import pandas as pd
data = {'state':['Ohio','Ohio','Ohio','Nevada', 'Nevada'], 'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [20]:
frame.to_excel("d:\\test01.xlsx")

In [22]:
for i in frame.columns:
    print(i)

pop
state
year

In [23]:
frame.columns=["change1","change2","change3"]

In [24]:
frame

   change1 change2  change3
0      1.5    Ohio     2000
1      1.7    Ohio     2001
2      3.6    Ohio     2002
3      2.4  Nevada     2001
4      2.9  Nevada     2002

In [25]:
frame.index = frame.A

AttributeError: 'DataFrame' object has no attribute 'A'

In [26]:
frame.index = frame.change1

In [27]:
frame

         change1 change2  change3
change1
1.5          1.5    Ohio     2000
1.7          1.7    Ohio     2001
3.6          3.6    Ohio     2002
2.4          2.4  Nevada     2001
2.9          2.9  Nevada     2002

In [31]:
frame.change3 = 2001
frame

         change1 change2  change3
change1
1.5          1.5    Ohio     2001
1.7          1.7    Ohio     2001
3.6          3.6    Ohio     2001
2.4          2.4  Nevada     2001
2.9          2.9  Nevada     2001

In [32]:
frame["debt"] = 16.5

In [33]:
frame

         change1 change2  change3  debt
change1
1.5          1.5    Ohio     2001  16.5
1.7          1.7    Ohio     2001  16.5
3.6          3.6    Ohio     2001  16.5
2.4          2.4  Nevada     2001  16.5
2.9          2.9  Nevada     2001  16.5

In [42]:
frame['estern']=frame.change2=='Ohio'
frame

         change1 change2  change3  debt  estern
change1
1.5          1.5    Ohio     2001  16.5    True
1.7          1.7    Ohio     2001  16.5    True
3.6          3.6    Ohio     2001  16.5    True
2.4          2.4  Nevada     2001  16.5   False
2.9          2.9  Nevada     2001  16.5   False

In [43]:
frame.T

change1   1.5   1.7   3.6     2.4     2.9
change1   1.5   1.7   3.6     2.4     2.9
change2  Ohio  Ohio  Ohio  Nevada  Nevada
change3  2001  2001  2001    2001    2001
debt     16.5  16.5  16.5    16.5    16.5
estern   True  True  True   False   False

In [44]:
frame.T

change1   1.5   1.7   3.6     2.4     2.9
change1   1.5   1.7   3.6     2.4     2.9
change2  Ohio  Ohio  Ohio  Nevada  Nevada
change3  2001  2001  2001    2001    2001
debt     16.5  16.5  16.5    16.5    16.5
estern   True  True  True   False   False

In [45]:
frame2 = frame.T

In [46]:
frame2

change1   1.5   1.7   3.6     2.4     2.9
change1   1.5   1.7   3.6     2.4     2.9
change2  Ohio  Ohio  Ohio  Nevada  Nevada
change3  2001  2001  2001    2001    2001
debt     16.5  16.5  16.5    16.5    16.5
estern   True  True  True   False   False

In [47]:
frame2.T

        change1 change2 change3  debt estern
change1
1.5         1.5    Ohio    2001  16.5   True
1.7         1.7    Ohio    2001  16.5   True
3.6         3.6    Ohio    2001  16.5   True
2.4         2.4  Nevada    2001  16.5  False
2.9         2.9  Nevada    2001  16.5  False